
public class ArrayExample1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		// 선 - 엑셀 column 개념
		// ------------- 1차원 배열 ---------------
		
		// 선언 + 정의
		int a[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9 };
		
		// 선언
		// int a[10]
		int b[] = new int[10];	
		b[0] = 10;
		b[1] = 10;
		b[2] = 10;
		b[3] = 10;
		
		// 면 - 엑셀 row 개념
		// ------------- 2차원 배열 ----------------
		// 선언 + 정의
		int c[][] =  {{ 10, 20 }, { 30, 40 }};
		
		// 선언
		int d[][] = new int[5][];	
		
		int e[][] = new int[5][5];	
		
		// 입체 - 엑셀 시트 개념
		// ------------- 3차원 배열 -----------------
		// 선언 + 정의
		int f[][][] =  {
			{
				{ 10, 20 },
				{ 30, 40 }
			},
			{
				{ 10, 20 },
				{ 30, 40 }
			}
		};
		
		// 선언
		int g[][][] = new int[5][][];	
		
		int h[][][] = new int[5][5][];
		
		int i[][][] = new int[5][5][5];	
		
		// 시공간
		// ------------- 4차원 배열 ----------------
		// 선언 + 정의
				int j[][][][] =  {
					{
						{
							{ 10, 20 },
							{ 30, 40 }
						},
						{
							{ 10, 20 },
							{ 30, 40 }
						}
					},
					{
						{
							{ 10, 20 },
							{ 30, 40 }
						},
						{
							{ 10, 20 },
							{ 30, 40 }
						}
					}
				};
				
				// 선언
				int k[][][][] = new int[5][][][];	
				
				int l[][][][] = new int[5][5][][];
				
				int m[][][][] = new int[5][5][5][];	
				
				int n[][][][] = new int[5][5][5][5];	
				
		
	}

}
